app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $data = [
            'title'           => 'Dashboard',
            'totalUsers'      => $this->userModel->countAll(),
            'totalProducts'   => $this->productModel->countAll(),
            'totalCategories' => $this->categoryModel->countAll(),
            'totalOrders'     => $this->orderModel->countAll(),
            'totalRevenue'    => $this->orderModel->getTotalRevenue(),
            'monthlyRevenue'  => $this->orderModel->getMonthlyRevenue(),
            'recentOrders'    => $this->orderModel->getOrdersWithUser(),
            'lowStockProducts'=> $this->productModel->getLowStockProducts(),
            'pendingOrders'   => $this->orderModel->where('order_status', 'pending')->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'pending'