app/Controllers/CartController.php

    public function index()
    {
        $cartKey = $this->getCartKey();
        if (!$cartKey) {
            $cart = [];
        } else {
            $cart = session()->get($cartKey) ?? [];
        }
        $cartItems = [];
        $total = 0;

        foreach ($cart as $productId => $item) {
            $product = $this->productModel->find($productId);
---
SELECT *
FROM `products`
WHERE `products`.`id` = 5