app/Controllers/CheckoutController.php

    public function index()
    {
        $cartKey = $this->getCartKey();
        $cart = session()->get($cartKey) ?? [];

        if (empty($cart)) {
            return redirect()->to('/cart')->with('error', 'Keranjang belanja kosong');
        }

        // Calculate cart total
        $cartItems = [];
        $total = 0;

        foreach ($cart as $productId => $item) {
            $product = $this->productModel->find($productId);
---
SELECT *
FROM `products`
WHERE `products`.`id` = 5

        $customer = null;
        $customerId = session()->get('customer_id');
        if ($customerId) {
            $customer = $this->userModel->find($customerId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

    public function process()
    {
        $cartKey = $this->getCartKey();
        if (!$cartKey) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }
        $cart = session()->get($cartKey) ?? [];

        if (empty($cart)) {
            return redirect()->to('/cart')->with('error', 'Keranjang belanja kosong');
        }

        $rules = [
            'phone'            => 'required',
            'shipping_address' => 'required|min_length[10]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Check stock availability
        $cartItems = [];
        $total = 0;

        foreach ($cart as $productId => $item) {
            $product = $this->productModel->find($productId);
---
SELECT *
FROM `products`
WHERE `products`.`id` = 5

        // Update customer phone if provided
        $phone = $this->request->getPost('phone');
        if ($phone) {
            $this->userModel->update($customerId, ['phone' => $phone]);
        }

        // Get customer data
        $customer = $this->userModel->find($customerId);
---
UPDATE `users` SET `phone` = '08123456789', `updated_at` = '2026-01-29 05:34:11'
WHERE `users`.`id` IN ('5')
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

            'payment_status'   => 'pending',
        ];

        $orderId = $this->orderModel->insert($orderData);
---
INSERT INTO `orders` (`customer_id`, `order_date`, `amount`, `shipping_address`, `order_status`, `payment_status`) VALUES ('5', '2026-01-29 05:34:11', 50000, 'knknlknlknlknknklnklnklnklnkln', 'pending', 'pending')


        // Create order details (don't update stock yet - wait for payment confirmation)
        foreach ($cartItems as $item) {
            $this->orderDetailModel->insert([
                'order_id'   => $orderId,
                'product_id' => $item['product']['id'],
                'price'      => $item['product']['price'],
                'quantity'   => $item['quantity'],
            ]);
---
INSERT INTO `order_details` (`order_id`, `product_id`, `price`, `quantity`) VALUES (22, '5', '50000.00', 1)

                'snap_token' => $snapToken,
            ];

            $updateResult = $this->orderModel->update($orderId, $updateData);
---
UPDATE `orders` SET `snap_token` = '22894609-7f06-424a-9019-248a88c9585d'
WHERE `orders`.`id` IN (22)

    public function success($orderId)
    {
        $order = $this->orderModel->select('orders.*, users.full_name as customer_name, users.email as customer_email')
                                  ->join('users', 'users.id = orders.customer_id')
                                  ->where('orders.id', $orderId)
                                  ->first();
---
SELECT `orders`.*, `users`.`full_name` as `customer_name`, `users`.`email` as `customer_email`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`customer_id`
WHERE `orders`.`id` = '22'
 LIMIT 1