app/Controllers/CustomerAuthController.php

SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();

SELECT *
FROM `products`
WHERE `products`.`id` = '5'
---
            $cart = session()->get($cartKey) ?? [];

            $productModel = new \App\Models\ProductModel();
            $product = $productModel->find($pendingCartItem['product_id']);