app/Controllers/PaymentController.php

SELECT *
FROM `orders`
WHERE `orders`.`id` = '22'
UPDATE `orders` SET `payment_status` = 'paid', `order_status` = 'processing', `transaction_id` = 'ORDER-22-1769664851', `payment_method` = 'midtrans'
WHERE `orders`.`id` IN ('22')
---
    private function updateOrderToPaid($orderId, $transactionId)
    {
        $order = $this->orderModel->find($orderId);

        if (!$order) {
            log_message('error', 'PaymentController: Order not found - ' . $orderId);
            return;
        }

        // Check if already paid to prevent duplicate stock update
        if ($order['payment_status'] === 'paid') {
            log_message('info', 'PaymentController: Order already paid - ' . $orderId);
            return; // Already paid, skip
        }

        // Start database transaction
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // Update payment status
            $this->orderModel->update($orderId, [
                'payment_status' => 'paid',
                'order_status'   => 'processing',
                'transaction_id' => $transactionId,
                'payment_method' => 'midtrans',
            ]);

SELECT *
FROM `products`
WHERE `products`.`id` = '5'
---
            // Update stock (only if not already updated)
            $orderItems = $this->orderDetailModel->getItemsByOrder($orderId);
            foreach ($orderItems as $item) {
                $product = $this->productModel->find($item['product_id']);

UPDATE `products` SET `stock` = 69, `updated_at` = '2026-01-29 05:34:35'
WHERE `products`.`id` IN ('5')
---
                    }

                    $newStock = $product['stock'] - $item['quantity'];
                    $this->productModel->update($item['product_id'], ['stock' => $newStock]);