app/Controllers/ShopController.php

SELECT *
FROM `categories`
---
        $total = $totalBuilder->countAllResults();

        // Get categories for filter
        $categories = $this->categoryModel->findAll();