app/Models/AuditLogModel.php

INSERT INTO `audit_logs` (`user_id`, `action`, `created_at`) VALUES ('5', 'Membuat pesanan baru dengan Midtrans (Order ID: 22, Total: Rp 50.000)', '2026-01-29 05:34:11')
---
    public function logAction($userId, $action)
    {
        return $this->insert([
            'user_id'    => $userId,
            'action'     => $action,
            'created_at' => date('Y-m-d H:i:s'),
        ]);