app/Models/OrderModel.php

SELECT `orders`.*, `users`.`full_name` as `customer_name`, `users`.`email` as `customer_email`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`customer_id`
ORDER BY `orders`.`order_date` DESC
---
    public function getOrdersWithUser()
    {
        return $this->select('orders.*, users.full_name as customer_name, users.email as customer_email')
                    ->join('users', 'users.id = orders.customer_id')
                    ->orderBy('orders.order_date', 'DESC')
                    ->findAll();

SELECT SUM(`amount`) AS `amount`
FROM `orders`
WHERE `payment_status` = 'paid'
 LIMIT 1
---
    public function getTotalRevenue()
    {
        $result = $this->selectSum('amount')
                      ->where('payment_status', 'paid')
                      ->first();

SELECT SUM(`amount`) AS `amount`
FROM `orders`
WHERE `payment_status` = 'paid'
AND MONTH(order_date) = '01'
AND YEAR(order_date) = '2026'
 LIMIT 1
---
    public function getMonthlyRevenue($month = null, $year = null)
    {
        $month = $month ?? date('m');
        $year = $year ?? date('Y');

        $result = $this->selectSum('amount')
                      ->where('payment_status', 'paid')
                      ->where('MONTH(order_date)', $month)
                      ->where('YEAR(order_date)', $year)
                      ->first();

SELECT `orders`.*, `users`.`full_name` as `customer_name`, `users`.`email` as `customer_email`, `users`.`phone` as `customer_phone`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`customer_id`
WHERE `orders`.`id` = '22'
AND `orders`.`customer_id` = '5'
 LIMIT 1
---
    public function getOrderWithDetails($orderId, $customerId = null)
    {
        $builder = $this->select('orders.*, users.full_name as customer_name, users.email as customer_email, users.phone as customer_phone')
                       ->join('users', 'users.id = orders.customer_id')
                       ->where('orders.id', $orderId);

        if ($customerId) {
            $builder->where('orders.customer_id', $customerId);
        }

        return $builder->first();