app/Models/OrderDetailModel.php

    public function getItemsByOrder($orderId)
    {
        return $this->select('order_details.*, products.name as product_name, products.image as product_image')
                    ->join('products', 'products.id = order_details.product_id', 'left')
                    ->where('order_id', $orderId)
                    ->findAll();
---
SELECT `order_details`.*, `products`.`name` as `product_name`, `products`.`image` as `product_image`
FROM `order_details`
LEFT JOIN `products` ON `products`.`id` = `order_details`.`product_id`
WHERE `order_id` = '22'