app/Models/ProductModel.php

SELECT `products`.*, GROUP_CONCAT(categories.name) as category_names
FROM `products`
LEFT JOIN `product_categories` ON `product_categories`.`product_id` = `products`.`id`
LEFT JOIN `categories` ON `categories`.`id` = `product_categories`.`category_id`
GROUP BY `products`.`id`
ORDER BY `products`.`created_at` DESC
 LIMIT 10
---
    public function getProductsWithCategoriesPaginated($search = null, $perPage = 10, $page = 1)
    {
        $builder = $this->select('products.*, GROUP_CONCAT(categories.name) as category_names')
                       ->join('product_categories', 'product_categories.product_id = products.id', 'left')
                       ->join('categories', 'categories.id = product_categories.category_id', 'left')
                       ->groupBy('products.id');

        // Add search filter
        if ($search) {
            $builder->groupStart()
                   ->like('products.name', $search)
                   ->orLike('products.sku', $search)
                   ->orLike('products.description', $search)
                   ->groupEnd();
        }

        $offset = ($page - 1) * $perPage;
        return $builder->orderBy('products.created_at', 'DESC')
                     ->limit($perPage, $offset)
                     ->findAll();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `products`.`id`
FROM `products`
LEFT JOIN `product_categories` ON `product_categories`.`product_id` = `products`.`id`
LEFT JOIN `categories` ON `categories`.`id` = `product_categories`.`category_id`
GROUP BY `products`.`id`
) CI_count_all_results
---
    public function getProductsCount($search = null)
    {
        $builder = $this->select('products.id')
                       ->join('product_categories', 'product_categories.product_id = products.id', 'left')
                       ->join('categories', 'categories.id = product_categories.category_id', 'left')
                       ->groupBy('products.id');

        // Add search filter
        if ($search) {
            $builder->groupStart()
                   ->like('products.name', $search)
                   ->orLike('products.sku', $search)
                   ->orLike('products.description', $search)
                   ->groupEnd();
        }

        return $builder->countAllResults();

SELECT *
FROM `products`
WHERE `stock` < 10
---
    public function getLowStockProducts($threshold = 10)
    {
        return $this->where('stock <', $threshold)->findAll();