app/Models/UserModel.php

    public function getUserRoles($userId)
    {
        return $this->db->table('user_roles')
                       ->select('roles.*')
                       ->join('roles', 'roles.id = user_roles.role_id')
                       ->where('user_roles.user_id', $userId)
                       ->get()
                       ->getResultArray();
---
SELECT `roles`.*
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`user_id` = '5'